constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
momentumSource
{
    type            semiImplicitSource;

    timeStart       0.0;
    duration        20000;
    selectionMode   all;

    volumeMode      absolute;

    sources
    {
        U
        {
            explicit    (0.005 0 0);
            implicit    0;
        }
    }
}


*/
releaseNO
{

    type            semiImplicitSource;
    active          yes;

        timeStart       0;
        duration        20000;
        selectionMode    points;
        //selectionMode   cellZone;
        //cellZone      releasePark
        points
        (
            (0 20 0.05)
        );

        volumeMode      absolute;
        
        sources
        {

        NO	
        {
            explicit         117;// micro g/s
            implicit         0;
	}


         NO2
        {
            explicit         17;// micro g/s
            implicit         0;
        }



}




// ************************************************************************* //
