0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{ version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {

        type            fixedValue;
        value           uniform (2.0 0 0);

    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            symmetry;
    }

    canyon
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }


    interfaces
    {
        type            empty;
    }





}

// ************************************************************************* //
