0/NO
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      NO;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{

inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    outlet
    {
        type            zeroGradient;
    }
    canyon
    {
        type            zeroGradient;
    }


    top
    {
        type            symmetry;
    }


    frontAndBack
    {
        type            empty;
    }


}


// ************************************************************************* //
