0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{ version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-04;

boundaryField
{   
    inlet
    {
        type            fixedValue;
        value           uniform 1.5e-04;
    }
    outlet
    {
        type            zeroGradient;
    }
 

    top
    {
        type            symmetry;
    }
    canyon
    {
        type            epsilonWallFunction;
        value           uniform 0.0;
    }
    frontAndBack
    {
        type            empty;
    }

    interfaces
    {
        type            empty;
    }
    



}


// ************************************************************************* //
